; domain
(define (domain multirobotdrone)
    (:requirements :strips :typing)

    ;; Types derived from scenario entities 
    ; The robot is not a type, becouse in this scenario we have only one robot
    ; so it can be modelled as one object in the problem file.
    (:types
        robot             ; Agents (Curator, Technician, Scientist)
        pod               ; Anti-vibration containers
        location          ; Rooms and tunnels
        artifact          ; Items to be retrieved
        artifact-type     ; Categories (scientific, technological, top-secret)
    )

    (:predicates
        ;; --- ROBOT STATE ---
        (robot-at ?r - robot ?l - location)
        (sealing-mode ?r - robot)                       ; Required for unpressurized zones
        
        ;; --- POSSESSION ---
        ; Slot 1: can hold pods or artifacts
        (hands-empty-slot-1 ?r - robot)
        (carrying-slot-1 ?r - robot ?a - artifact)              ; Robot is carrying artifact ?a
        (carrying-pod-slot-1 ?r - robot ?p - pod)               ; Robot is holding a pod
        
        ; Slot 2: can hold only artifacts
        (hands-empty-slot-2 ?r - robot)
        (carrying-slot-2 ?r - robot ?a - artifact)             

        ;; --- CAPABILITIES ---
        (can-access ?r - robot ?l - location)           ; Access permissions per room
        (can-pickup ?r - robot ?at - artifact-type)     ; Permissions per artifact type
        (can-carry-two ?r - robot)                      ; Flag for Technician-type robots
        (can-fly ?r - robot)

        
        ;; --- ENVIRONMENTAL PROPERTIES ---
        (connected ?l1 ?l2 - location)
        (is-pressurized ?l - location)
        (is-unpressurized ?l - location)
        (is-safe ?l - location)                         ; Room status (safe to enter)
        (is-seismic ?l - location)                      ; Triggers safety checks
        (is-standard-room ?l - location)                ; Normal storage/drop rooms
        (is-chill-room ?l - location)                   ; Rooms that cool artifacts (Cryo-Chamber)

        ;; --- ARTIFACT & POD STATUS ---
        (artifact-at ?a - artifact ?l - location)
        (is-type ?a - artifact ?t - artifact-type)
        (fragile ?a - artifact)
        (no-fragile ?a - artifact)
        (warm ?a - artifact)
        (cold ?a - artifact)
        
        (pod-empty ?p - pod)
        (pod-contains ?p - pod ?a - artifact)           ; Artifact-pod association
        (pod-at ?p - pod ?l - location)
    )

    
    ;; ========================
    ;; ACTIONS 
    ;; ========================

    ;; MOVEMENT
    ;; tries to move to a room without checking its safety status. If the room is safe, the robot can move there, otherwise it can't.
    (:action fly-into-seismic-room
        :parameters (?r - robot ?to ?from - location)
        :precondition (and 
            (sealing-mode ?r)
            (robot-at ?r ?from) 
            (connected ?from ?to) 
            (is-seismic ?to)
            (can-access ?r ?to)
            (can-fly ?r)
        )
        :effect (and 
            (not (robot-at ?r ?from)) 
            (robot-at ?r ?to)
            (not (sealing-mode ?r))
        )
    )

    ;; MOVEMENT

    ;; A: Moving Empty (No artifact constraints) -> No artifact position updade
    ;; 1. Move Empty to a Safe Room (No sealing needed)
    (:action move-to-pressurized-room
        :parameters (?r - robot ?from ?to - location)
        :precondition (and 
            (robot-at ?r ?from)
            (connected ?from ?to)
            (is-pressurized ?to)       ;; Target is pressurized 
            (is-safe ?to)              ;; Target is safe
            (can-access ?r ?to)
        )
        :effect (and 
            (not (robot-at ?r ?from)) 
            (robot-at ?r ?to)
            (not (sealing-mode ?r))
        )
    )

    ;; 2. Move Empty to Tunnel (Requires Sealing)
    (:action move-to-unpressurized-room
        :parameters (?r - robot ?from ?to - location)
        :precondition (and 
            (robot-at ?r ?from)
            (connected ?from ?to)
            (is-unpressurized ?to)     ;; Target is unpressurized
            (sealing-mode ?r)             ;; Constraint: Must be sealed
            ; (is-safe ?to)              ;; Target is safe (tunnel is always safe, so no need to check)
            (can-access ?r ?to)         ; also this could be skipped (since everybody can access the tunnel) but we can keep it for consistency with the other move actions
        )
        :effect (and 
            (not (robot-at ?r ?from)) 
            (robot-at ?r ?to)
        )
    )


    ;; SEALING MECHANISM
    ;; Robot activates sealing mode. Can be done anywhere.
    (:action activate-seal
        :parameters (?r - robot)
        :precondition ()
        :effect (sealing-mode ?r)
    )
    (:action deactivate-seal
        :parameters (?r - robot ?l - location)
        :precondition (and 
            (robot-at ?r ?l)
            (is-pressurized ?l) ; Safety check: Cannot vent in a tunnel
            (sealing-mode ?r)
        )
        :effect (not (sealing-mode ?r))
    )


    ;; POD MANAGEMENT: EQUIPPING & UNEQUIPPING
    ;; 1. Pick Up Pod
    ;; Transition: hands-empty -> carrying-pod
    (:action pick-up-pod-slot-1
        :parameters (?r - robot ?l - location ?p - pod)
        :precondition (and 
            (robot-at ?r ?l)
            (pod-at ?p ?l)
            (hands-empty-slot-1 ?r)                ; Must have free hands
        )
        :effect (and 
            (not (pod-at ?p ?l))
            (not (hands-empty-slot-1 ?r))
            (carrying-pod-slot-1 ?r ?p)
        )
    )
    

    ;; 2. Drop Pod
    ;; Transition: carrying-empty-pod -> hands-empty
    ;; Useful if we need to free hands to move a non-fragile item normally
    (:action drop-pod-slot-1
        :parameters (?r - robot ?p - pod ?l - location)
        :precondition (and 
            (carrying-pod-slot-1 ?r ?p)
            (robot-at ?r ?l)
        )
        :effect (and 
            (not (carrying-pod-slot-1 ?r ?p))
            (hands-empty-slot-1 ?r)
            (pod-at ?p ?l)       ; Pod is now available in the room
        )
    )
    
    
    ;; PICK UP ARTIFACT ACTIONS

    ;; 1. STANDARD PICK UP
    ;; Transition: hands-empty -> carrying ?a
    ;; Used for sturdy items. If you pick up a fragile item this way, 
    ;; you won't be able to move it (due to move constraints).
    (:action pick-up-slot-1
        :parameters (?a - artifact ?at - artifact-type ?l - location ?r - robot)
        :precondition (and 
            (robot-at ?r ?l)                    ; Robot and Artifact in the same 
            (artifact-at ?a ?l)                 ; location
            (hands-empty-slot-1 ?r)             ; Robot free
            (no-fragile  ?a)
            (can-pickup ?r ?at)
            (is-type  ?a ?at)
        )
        :effect (and 
            (not (hands-empty-slot-1 ?r)) 
            (carrying-slot-1 ?r ?a)            
            (not (artifact-at ?a ?l))
        )
    )

    (:action pick-up-slot-2
        :parameters (?a - artifact ?at - artifact-type ?l - location ?r - robot)
        :precondition (and 
            (robot-at ?r ?l)            ; Robot and Artifact in the same 
            (can-carry-two ?r)
            (artifact-at ?a ?l)      ; location
            (hands-empty-slot-2 ?r)             ; Robot free
            (no-fragile  ?a)
            (can-pickup ?r ?at)
            (is-type  ?a ?at)
        )
        :effect (and 
            (not (hands-empty-slot-2 ?r)) 
            (carrying-slot-2 ?r ?a)            
            (not (artifact-at ?a ?l))
        )
    )

    ;; 4. PUT IN POD (Load into Pod)
    ;; Transition: carrying-empty-pod -> carrying-in-pod ?a
    ;; This action "secures" the artifact immediately.
    (:action put-in-pod
        :parameters (?a - artifact ?at - artifact-type ?l - location ?r - robot ?p - pod)
        :precondition (and 
            (robot-at ?r ?l)            ; Robot and Artifact in the same 
            (artifact-at ?a ?l)         ; location
            (carrying-pod-slot-1 ?r ?p)     ; Robot carrying already an empty pod
            (pod-empty ?p)                  ; Pod is empty
            (can-pickup ?r ?at)
            (is-type  ?a ?at)
        )
        :effect (and 
            (not (artifact-at ?a ?l))
            (not (pod-empty ?p))
            (pod-contains ?p ?a)
        )
    )


    ;; DROP DOWN ACTIONS
    ;; A. Dropping to Standard Rooms
    ;; 1. Standard Artifact Drop 
    ;; Transition: carrying ?a -> hands-empty
    (:action release-artifact-slot-1
        :parameters (?r - robot ?a - artifact ?l - location)
        :precondition (and 
            (robot-at ?r ?l) 
            (carrying-slot-1 ?r ?a)
            (is-standard-room ?l)
        )
        :effect (and 
            (not (carrying-slot-1 ?r ?a)) 
            (hands-empty-slot-1 ?r) 
            (artifact-at ?a ?l)
        )
    )

        (:action release-artifact-slot-2
        :parameters (?r - robot ?a - artifact ?l - location)
        :precondition (and 
            (robot-at ?r ?l) 
            (can-carry-two ?r)
            (carrying-slot-2 ?r ?a)
            (is-standard-room ?l)
        )
        :effect (and 
            (not (carrying-slot-2 ?r ?a)) 
            (hands-empty-slot-2 ?r) 
            (artifact-at ?a ?l)
        )
    )

    ;; 2. Unload From Pod (Standard Room)
    ;; Transition: carrying-full-pod -> carrying-empty-pod
    (:action release-artifact-from-pod-slot-1
        :parameters (?r - robot ?a - artifact ?l - location ?p - pod) ;; Aggiunto ?p
        :precondition (and
            (robot-at ?r ?l)
            (carrying-pod-slot-1 ?r ?p)  
            (pod-contains ?p ?a)       
            (is-standard-room ?l)
        )
        :effect (and
            (not (pod-contains ?p ?a))  ; Pod is now empty
            (artifact-at ?a ?l)        ; Artifact is now at the location
            (pod-empty ?p)            ; Pod is marked as empty
        )
    )

    ;; B. Dropping to Cryo-Chamber (Temperature Effect)
    ;; 3. Cryo Drop (From Bare Hands)
    ;; Transition: carrying ?a -> hands-empty
    (:action release-artifact-cryo-slot-1                      ; robot releases a non-fragil artifact in the cryo-chamber and it becomes cold
        :parameters (?r - robot ?a - artifact ?l - location)
        :precondition (and 
            (robot-at ?r ?l) 
            (carrying-slot-1 ?r ?a)
            (is-chill-room ?l)
            (warm  ?a )
        )
        :effect (and 
            (not (carrying-slot-1 ?r ?a)) 
            (hands-empty-slot-1 ?r) 
            (artifact-at ?a ?l)
            (not (warm ?a)) (cold ?a) ; Instant Temp Logic
        )
    )

    (:action release-artifact-cryo-slot-2                      ; robot releases a non-fragil artifact in the cryo-chamber and it becomes cold
        :parameters (?r - robot ?a - artifact ?l - location)
        :precondition (and 
            (robot-at ?r ?l) 
            (can-carry-two ?r)
            (carrying-slot-2 ?r ?a)
            (is-chill-room ?l)
            (warm  ?a )
        )
        :effect (and 
            (not (carrying-slot-2 ?r ?a)) 
            (hands-empty-slot-2 ?r) 
            (artifact-at ?a ?l)
            (not (warm ?a)) (cold ?a) ; Instant Temp Logic
        )
    )

    ;; 4. Cryo Unload (From Pod)
    (:action release-artifact-cryo-from-pod-slot-1
        :parameters (?r - robot ?a - artifact ?l - location ?p - pod)
        :precondition (and 
            (robot-at ?r ?l)
            (carrying-pod-slot-1 ?r ?p)
            (pod-contains ?p ?a)
            (is-chill-room ?l)
        )
        :effect (and 
            (artifact-at ?a ?l)
            (not (pod-contains ?p ?a))
            (pod-empty ?p)
            (not (warm ?a)) (cold ?a) ; Instant Temp Logic
        )
    )
)

; problem
(define (problem multirobotdroneproblem)
  (:domain multirobotdrone)

  (:objects
    ;; --- Robots ---
    curator scientist drone - robot

    ;; --- Pods ---
    pod1 pod2 - pod
    
    ;; --- Locations ---
    entrance maintenance-tunnel - location
    hall-a hall-b cryo-chamber - location
    anti-vibration-pods-room stasis-lab - location

    ;; --- Typologies ---
    technological scientific top-secret - artifact-type
      
    ;; --- Artifacts ---
    mart-nord-core-drill mart-sud-core-drill - artifact
    mart-east-core-drill mart-west-core-drill - artifact
    mart-sand-sample mart-north-pole-ice-sample - artifact
    mart-mysterious-egg mart-laser-gun mart-pink-hat - artifact
    rover-wheel space-suit quantum-chip - artifact
    asteroid-MG04TN-ice-sample asteroid-AD29TV-rock-sample - artifact
    venus-sand-sample venus-rock-sample - artifact
  )

  (:init
    ;; ============================================================
    ;; ROBOT CAPABILITIES & INITIAL STATE
    ;; ============================================================
    
    ;; Curator
    (robot-at curator entrance) (hands-empty-slot-1 curator)
    (can-access curator entrance) (can-access curator maintenance-tunnel) (can-access curator hall-a)
    (can-access curator cryo-chamber) (can-access curator anti-vibration-pods-room) (can-access scientist stasis-lab)
    (can-pickup curator technological) (can-pickup curator top-secret)

    ;; Scientist
    (robot-at scientist stasis-lab)   (hands-empty-slot-1 scientist)
    (can-access scientist stasis-lab) (can-access scientist maintenance-tunnel) (can-access scientist cryo-chamber)
    (can-pickup scientist scientific)
    
    ; Drone
    (robot-at drone entrance) (hands-empty-slot-1 drone)
    (can-carry-two drone) (hands-empty-slot-2 drone)
    (can-access drone entrance) (can-access drone maintenance-tunnel) (can-access drone hall-b) (can-access drone anti-vibration-pods-room)
    (can-pickup drone scientific) (can-pickup drone top-secret) (can-pickup drone technological)
    (can-fly drone)

    ;; ============================================================
    ;; WORLD TOPOLOGY & PROPERTIES
    ;; ============================================================
    
    ;; Connections
    (connected entrance maintenance-tunnel) (connected maintenance-tunnel entrance)
    (connected maintenance-tunnel hall-a) (connected hall-a maintenance-tunnel)
    (connected maintenance-tunnel hall-b) (connected hall-b maintenance-tunnel)
    (connected maintenance-tunnel cryo-chamber) (connected cryo-chamber maintenance-tunnel)
    (connected maintenance-tunnel anti-vibration-pods-room) (connected anti-vibration-pods-room maintenance-tunnel)
    (connected maintenance-tunnel stasis-lab) (connected stasis-lab maintenance-tunnel)

    ;; Pressure & Safety
    (is-unpressurized maintenance-tunnel)
    (is-pressurized entrance) (is-pressurized hall-a) (is-pressurized hall-b) 
    (is-pressurized cryo-chamber) (is-pressurized anti-vibration-pods-room) (is-pressurized stasis-lab)

    (is-safe entrance) (is-safe hall-a) (is-safe cryo-chamber)
    (is-safe anti-vibration-pods-room) (is-safe maintenance-tunnel) (is-safe stasis-lab)
    
    ;; Special Room Properties
    (is-seismic hall-b)
    (is-chill-room cryo-chamber)
    (is-standard-room hall-a) (is-standard-room hall-b) (is-standard-room entrance) 
    (is-standard-room anti-vibration-pods-room) (is-standard-room stasis-lab)
    (is-unpressurized maintenance-tunnel)

    ;; Pods
    (pod-empty pod1) (pod-empty pod2)
    (pod-at pod1 anti-vibration-pods-room ) (pod-at pod2 anti-vibration-pods-room)

    ;; ============================================================
    ;; ARTIFACTS BY ROOM (Position, Type, Features)
    ;; ============================================================

    ;; --- HALL A ---
    ;; Martian Core Drills
    (artifact-at mart-nord-core-drill hall-a) (is-type mart-nord-core-drill scientific) (warm mart-nord-core-drill) (no-fragile mart-nord-core-drill)
    (artifact-at mart-sud-core-drill hall-a) (is-type mart-sud-core-drill scientific) (warm mart-sud-core-drill) (no-fragile mart-sud-core-drill)
    (artifact-at mart-east-core-drill hall-a) (is-type mart-east-core-drill scientific) (warm mart-east-core-drill) (no-fragile mart-east-core-drill)
    (artifact-at mart-west-core-drill hall-a) (is-type mart-west-core-drill scientific) (warm mart-west-core-drill) (no-fragile mart-west-core-drill)
    
    ;; Hall A: Samples & Mysterious Egg
    (artifact-at mart-north-pole-ice-sample hall-a) (is-type mart-north-pole-ice-sample scientific) (warm mart-north-pole-ice-sample) (no-fragile mart-north-pole-ice-sample)
    (artifact-at mart-mysterious-egg hall-a) (is-type mart-mysterious-egg top-secret) (warm mart-mysterious-egg) (no-fragile mart-mysterious-egg)
    ;; (artifact-at asteroid-MG04TN-ice-sample hall-a) (is-type asteroid-MG04TN-ice-sample scientific) (warm asteroid-MG04TN-ice-sample) (no-fragile asteroid-MG04TN-ice-sample)

    ;; --- HALL B ---
    ;; Mission Gear
    (artifact-at rover-wheel hall-b) (is-type rover-wheel technological) (warm rover-wheel) (fragile rover-wheel)
    ;; (artifact-at space-suit hall-b) (is-type space-suit technological) (warm space-suit) (fragile space-suit)
    ;; (artifact-at quantum-chip hall-b) (is-type quantum-chip technological) (warm quantum-chip) (fragile quantum-chip)

    ;; Hall B: Samples & Civilization Artifacts
    (artifact-at mart-sand-sample hall-b) (is-type mart-sand-sample scientific) (warm mart-sand-sample) (fragile mart-sand-sample)
    (artifact-at mart-laser-gun hall-b) (is-type mart-laser-gun top-secret) (warm mart-laser-gun) (fragile mart-laser-gun)
    ;; (artifact-at mart-pink-hat hall-b) (is-type mart-pink-hat top-secret) (warm mart-pink-hat) (fragile mart-pink-hat)
    ;; (artifact-at asteroid-AD29TV-rock-sample hall-b) (is-type asteroid-AD29TV-rock-sample scientific) (warm asteroid-AD29TV-rock-sample) (fragile asteroid-AD29TV-rock-sample)
    (artifact-at venus-sand-sample hall-b) (is-type venus-sand-sample scientific) (warm venus-sand-sample) (no-fragile venus-sand-sample)
    (artifact-at venus-rock-sample hall-b) (is-type venus-rock-sample scientific) (warm venus-rock-sample) (no-fragile venus-rock-sample)
  
  )

  ;; ============================================================
  ;; GOAL STATE
  ;; ============================================================
  (:goal (and
    ;; Final Locations
    ; (artifact-at mart-nord-core-drill stasis-lab) (cold mart-nord-core-drill)
    ; (artifact-at mart-sud-core-drill stasis-lab) (cold mart-sud-core-drill)
    ; (artifact-at mart-east-core-drill stasis-lab) (cold mart-east-core-drill)
    ; (artifact-at mart-west-core-drill stasis-lab) (cold mart-west-core-drill)
    ; (artifact-at rover-wheel stasis-lab)
    ;; (artifact-at space-suit stasis-lab)
    ;; (artifact-at quantum-chip stasis-lab) (cold quantum-chip)

    ; (artifact-at mart-north-pole-ice-sample cryo-chamber)
    ; (artifact-at mart-mysterious-egg cryo-chamber)    
    ; ;; (artifact-at asteroid-MG04TN-ice-sample cryo-chamber)

    ; (artifact-at mart-sand-sample hall-a)
    ; (artifact-at mart-laser-gun hall-a)
    ; ;; (artifact-at mart-pink-hat hall-a)  
    ; ;; (artifact-at asteroid-AD29TV-rock-sample hall-a)  
    ; (artifact-at venus-sand-sample hall-a)
    (artifact-at venus-rock-sample hall-a)

    (robot-at drone entrance)
    )   
  )
)

; plan
1. (activate-seal curator)
   added: (sealing-mode curator)
   goals met: 1 of 2
2. (activate-seal drone)
   added: (sealing-mode drone)
   goals met: 1 of 2
3. (move-to-unpressurized-room curator entrance maintenance-tunnel)
   deleted: (robot-at curator entrance)
   added: (robot-at curator maintenance-tunnel)
   goals met: 1 of 2
4. (move-to-pressurized-room curator maintenance-tunnel hall-a)
   deleted: (robot-at curator maintenance-tunnel) (sealing-mode curator)
   added: (robot-at curator hall-a)
   goals met: 1 of 2
5. (activate-seal curator)
   added: (sealing-mode curator)
   goals met: 1 of 2
6. (move-to-unpressurized-room drone entrance maintenance-tunnel)
   deleted: (robot-at drone entrance)
   added: (robot-at drone maintenance-tunnel)
   goals met: 0 of 2
7. (move-to-pressurized-room drone maintenance-tunnel anti-vibration-pods-room)
   deleted: (robot-at drone maintenance-tunnel) (sealing-mode drone)
   added: (robot-at drone anti-vibration-pods-room)
   goals met: 0 of 2
8. (pick-up-pod-slot-1 drone anti-vibration-pods-room pod2)
   deleted: (pod-at pod2 anti-vibration-pods-room) (hands-empty-slot-1 drone)
   added: (carrying-pod-slot-1 drone pod2)
   goals met: 0 of 2
9. (activate-seal drone)
   added: (sealing-mode drone)
   goals met: 0 of 2
10. (move-to-unpressurized-room drone anti-vibration-pods-room maintenance-tunnel)
   deleted: (robot-at drone anti-vibration-pods-room)
   added: (robot-at drone maintenance-tunnel)
   goals met: 0 of 2
11. (fly-into-seismic-room drone hall-b maintenance-tunnel)
   deleted: (robot-at drone maintenance-tunnel) (sealing-mode drone)
   added: (robot-at drone hall-b)
   goals met: 0 of 2
12. (put-in-pod venus-rock-sample scientific hall-b drone pod2)
   deleted: (artifact-at venus-rock-sample hall-b) (pod-empty pod2)
   added: (pod-contains pod2 venus-rock-sample)
   goals met: 0 of 2
13. (activate-seal drone)
   added: (sealing-mode drone)
   goals met: 0 of 2
14. (move-to-unpressurized-room drone hall-b maintenance-tunnel)
   deleted: (robot-at drone hall-b)
   added: (robot-at drone maintenance-tunnel)
   goals met: 0 of 2
15. (drop-pod-slot-1 drone pod2 maintenance-tunnel)
   deleted: (carrying-pod-slot-1 drone pod2)
   added: (hands-empty-slot-1 drone) (pod-at pod2 maintenance-tunnel)
   goals met: 0 of 2
16. (move-to-pressurized-room drone maintenance-tunnel entrance)
   deleted: (robot-at drone maintenance-tunnel) (sealing-mode drone)
   added: (robot-at drone entrance)
   goals met: 1 of 2
17. (move-to-unpressurized-room curator hall-a maintenance-tunnel)
   deleted: (robot-at curator hall-a)
   added: (robot-at curator maintenance-tunnel)
   goals met: 1 of 2
18. (pick-up-pod-slot-1 curator maintenance-tunnel pod2)
   deleted: (pod-at pod2 maintenance-tunnel) (hands-empty-slot-1 curator)
   added: (carrying-pod-slot-1 curator pod2)
   goals met: 1 of 2
19. (move-to-pressurized-room curator maintenance-tunnel hall-a)
   deleted: (robot-at curator maintenance-tunnel) (sealing-mode curator)
   added: (robot-at curator hall-a)
   goals met: 1 of 2
20. (release-artifact-from-pod-slot-1 curator venus-rock-sample hall-a pod2)
   deleted: (pod-contains pod2 venus-rock-sample)
   added: (artifact-at venus-rock-sample hall-a) (pod-empty pod2)
   goals met: 2 of 2
